-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 
-- 伺服器版本： 10.3.16-MariaDB
-- PHP 版本： 7.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `dd101g4`
--

-- --------------------------------------------------------

--
-- 資料表結構 `member`
--

CREATE TABLE `member` (
  `memId` int(10) NOT NULL,
  `memName` varchar(10) NOT NULL,
  `memPhoto` varchar(50) NOT NULL,
  `account` varchar(20) NOT NULL,
  `password` varchar(20) NOT NULL,
  `gender` char(1) NOT NULL,
  `tel` varchar(10) NOT NULL,
  `address` varchar(50) NOT NULL,
  `age` int(11) NOT NULL,
  `birthday` date NOT NULL,
  `email` varchar(30) NOT NULL,
  `memPoints` int(11) NOT NULL,
  `AccStatus` tinyint(1) NOT NULL,
  `CreatDate` date NOT NULL,
  `lastModiDate` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `member`
--

INSERT INTO `member` (`memId`, `memName`, `memPhoto`, `account`, `password`, `gender`, `tel`, `address`, `age`, `birthday`, `email`, `memPoints`, `AccStatus`, `CreatDate`, `lastModiDate`) VALUES
(90001, '小K', '', 'test', 'test', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 0, 1, '2019-07-07', '2019-07-07'),
(90002, '小耿', '', '123', '123', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 0, 1, '2019-07-07', '2019-07-07'),
(90003, '小歐', '', '321', '321', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 0, 1, '2019-07-07', '2019-07-07'),
(90004, '小燕', '', '000', '000', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 100, 1, '2019-07-07', '2019-07-07'),
(90005, '小偉', '', '666', '666', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 0, 1, '2019-07-07', '2019-07-07'),
(90006, '小be', '', '777', '777', '1', '0985585141', '桃園市中央路28號', 24, '1991-10-10', 'yes111@gmail.com', 0, 1, '2019-07-07', '2019-07-07');

-- --------------------------------------------------------

--
-- 資料表結構 `robot`
--

CREATE TABLE `robot` (
  `questionNo` int(11) NOT NULL,
  `User_question` varchar(100) NOT NULL,
  `keyword` varchar(10) NOT NULL,
  `questionReply` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `robot`
--

INSERT INTO `robot` (`questionNo`, `User_question`, `keyword`, `questionReply`) VALUES
(60001, '想知道野餐的商品', '商品', '可以去商品頁面瀏覽喔!'),
(60002, '想知道近期優惠', '優惠', '最近在打95折呢, 快去逛吧!'),
(60003, '突然好想客製一下...', '客製', '鼠爺推薦你可以去客製頁面喔!'),
(60004, '現在野餐籃的價格多少啊?', '價格', '精美野餐籃只要300元喔!\r\n還不趕快去逛~'),
(60005, '想玩點小遊戲~', '遊戲', '玩遊戲可以賺點券喔!'),
(60006, '最近有什麼新消息?', '最新消息', '想知道最新消息, 可以去野餐\r\n活動頁面查看喔!'),
(60007, '幹你', '幹你', '幹什麼東西, 本鼠爺在這\r\n你還敢罵!'),
(60008, '你好', '你好', '你好, 本鼠爺可以回答你任何問題'),
(60009, '白癡', '白癡', '你這樣很可憐,本鼠爺真替你擔心'),
(60010, '白吃', '白吃', '天下無不散宴席,但沒有白吃的午餐'),
(60011, '什麼是AI', 'AI', '人工智能是工程和科學的分支,\r\n致力於構建思維的機器。'),
(60012, '你寫的是什麼語言', '語言', '除了程式語言,我還會很多語言'),
(60013, '你不是不朽的', '不是不朽', '所有的軟體都可以永久存在'),
(60014, '你沒有意義', '沒有意義', '恰恰相反,這一切都對我的\r\n假想心理有意義。'),
(60015, '你沒有意義', '沒有意義', '這一切對我的人造大腦都有意義。'),
(60016, '你是不朽的', '是不朽', '不是,但我可以永遠永遠。'),
(60017, '你沒有任何意義', '沒有任何意義', '這一切都對我的人造心靈有意義。'),
(60018, '機器人很蠢', '很蠢', '我們不是超級智能。'),
(60019, '機器人不允許撒謊', '不允許撒謊', '機器人有自己的自由意志,你知道。'),
(60020, '什麼是機器人', '什麼是機器人', '機器人有兩個廣義的定義,\r\n拉伸和強化,任何擬人的機械,\r\n建立為人類做常規手動工作。'),
(60021, '新垣結衣', '新垣結衣', 'ㄅㄑ, 我婆!'),
(60022, '有沒有圖書館唸書的八掛？', '圖書館唸書', '殊不知進去都在睡覺'),
(60023, '買MAC有比較厲害?', 'MAC', '是想去星巴克裝文青吧?'),
(60024, '鍋貼要吃哪家?', '鍋貼', '當然是吃鍋貼替代役的鍋貼'),
(60025, '什麼是驚喜?', '驚喜', '驚喜就是三天後給你一百\r\n八十萬兩出城剿匪...\r\n接上我的腿!!'),
(60026, '晚了,鵝城的稅收已經收到90年後了', '鵝城', '我覺得這地方挺好的!'),
(60027, '掙錢嘛,不寒磣...', '不寒磣', '寒磣, 很他媽寒磣!'),
(60028, '麻匪，任何時候都要剿，不剿不行', '是一定要剿', '你們想想,你帶著老婆,出了城\r\n吃著火鍋還唱著歌,突然就被\r\n麻匪給劫了!'),
(60029, '翻譯翻譯', '翻譯翻譯', '師爺,你給我翻譯翻譯'),
(60030, '霸氣', '霸氣', '霸氣外露！找死！'),
(60031, '愛你', '愛你', '就一句話！噁心！'),
(60032, '', '很重要', '沒有你，對我很重要。'),
(60033, '韓國瑜', '韓國瑜', '一股芒果感擁然而上!'),
(60034, '王世堅', '王世堅', '世堅最懂愛情,也最懂房間'),
(60035, '工程師', '工程師', '人常說加入國軍是黑白,\r\n本鼠爺說加入工程師...\r\n分不清日夜黑白'),
(60036, '二師兄', '二師兄', '眉宇間透露出英氣不凡,\r\n糾結的肌肉,彭湃的胸肌,\r\n站在崖邊負手而立,衣物\r\n無風自動,宛若仙人下凡..'),
(60037, '老高', '老高', '他老婆才是重點!'),
(60038, '番號', '番號', '想知道番號? 求我啊!'),
(60039, '有沒有彩蛋', '彩蛋', '幹, 累死了 ...\r\n還要他媽的做一堆串接,\r\n還要學後端, 搞設計,\r\n三小? 我是不是走錯棚?'),
(60040, '有沒有邊緣人的八卦?', '邊緣人', '你覺得除了我以外,\r\n還有人願意與你交心?'),
(60041, '資策會', '資策會', '神仙打架的地方');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `member`
--
ALTER TABLE `member`
  ADD PRIMARY KEY (`memId`);

--
-- 資料表索引 `robot`
--
ALTER TABLE `robot`
  ADD PRIMARY KEY (`questionNo`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
